evaluation/memory/vllm_log/SD/SD_pulse_vllm.txt
(APIServer pid=14619) INFO 12-12 14:39:53 [api_server.py:1351] vLLM API server version 0.13.0rc2.dev79+g8f8fda261
(APIServer pid=14619) INFO 12-12 14:39:53 [utils.py:253] non-default args: {'model_tag': 'meta-llama/Llama-3.1-8B', 'port': 8100, 'disable_uvicorn_access_log': True, 'model': 'meta-llama/Llama-3.1-8B', 'max_model_len': 2048, 'enforce_eager': True, 'block_size': 16, 'enable_prefix_caching': True, 'kv_cache_metrics': True, 'max_num_batched_tokens': 2048, 'max_num_seqs': 128}
(APIServer pid=14619) INFO 12-12 14:39:54 [model.py:514] Resolved architecture: LlamaForCausalLM
(APIServer pid=14619) INFO 12-12 14:39:54 [model.py:1636] Using max model len 2048
(APIServer pid=14619) INFO 12-12 14:39:54 [scheduler.py:228] Chunked prefill is enabled with max_num_batched_tokens=2048.
(APIServer pid=14619) WARNING 12-12 14:39:54 [vllm.py:622] Enforce eager set, overriding optimization level to -O0
(APIServer pid=14619) INFO 12-12 14:39:54 [vllm.py:722] Cudagraph is disabled under eager mode
(EngineCore_DP0 pid=14757) INFO 12-12 14:40:03 [core.py:93] Initializing a V1 LLM engine (v0.13.0rc2.dev79+g8f8fda261) with config: model='meta-llama/Llama-3.1-8B', speculative_config=None, tokenizer='meta-llama/Llama-3.1-8B', skip_tokenizer_init=False, tokenizer_mode=auto, revision=None, tokenizer_revision=None, trust_remote_code=False, dtype=torch.bfloat16, max_seq_len=2048, download_dir=None, load_format=auto, tensor_parallel_size=1, pipeline_parallel_size=1, data_parallel_size=1, disable_custom_all_reduce=False, quantization=None, enforce_eager=True, kv_cache_dtype=auto, device_config=cuda, structured_outputs_config=StructuredOutputsConfig(backend='auto', disable_fallback=False, disable_any_whitespace=False, disable_additional_properties=False, reasoning_parser='', reasoning_parser_plugin='', enable_in_reasoning=False), observability_config=ObservabilityConfig(show_hidden_metrics_for_version=None, otlp_traces_endpoint=None, collect_detailed_traces=None, kv_cache_metrics=True, kv_cache_metrics_sample=0.01, cudagraph_metrics=False, enable_layerwise_nvtx_tracing=False), seed=0, served_model_name=meta-llama/Llama-3.1-8B, enable_prefix_caching=True, enable_chunked_prefill=True, pooler_config=None, compilation_config={'level': None, 'mode': <CompilationMode.NONE: 0>, 'debug_dump_path': None, 'cache_dir': '', 'compile_cache_save_format': 'binary', 'backend': 'inductor', 'custom_ops': ['all'], 'splitting_ops': [], 'compile_mm_encoder': False, 'compile_sizes': [], 'compile_ranges_split_points': [2048], 'inductor_compile_config': {'enable_auto_functionalized_v2': False, 'combo_kernels': True, 'benchmark_combo_kernel': True}, 'inductor_passes': {}, 'cudagraph_mode': <CUDAGraphMode.NONE: 0>, 'cudagraph_num_of_warmups': 0, 'cudagraph_capture_sizes': [], 'cudagraph_copy_inputs': False, 'cudagraph_specialize_lora': True, 'use_inductor_graph_partition': False, 'pass_config': {'fuse_norm_quant': False, 'fuse_act_quant': False, 'fuse_attn_quant': False, 'eliminate_noops': False, 'enable_sp': False, 'fuse_gemm_comms': False, 'fuse_allreduce_rms': False}, 'max_cudagraph_capture_size': 0, 'dynamic_shapes_config': {'type': <DynamicShapesType.BACKED: 'backed'>, 'evaluate_guards': False}, 'local_cache_dir': None}
(EngineCore_DP0 pid=14757) INFO 12-12 14:40:03 [parallel_state.py:1203] world_size=1 rank=0 local_rank=0 distributed_init_method=tcp://143.248.136.86:45983 backend=nccl
(EngineCore_DP0 pid=14757) INFO 12-12 14:40:03 [parallel_state.py:1411] rank 0 in world size 1 is assigned as DP rank 0, PP rank 0, PCP rank 0, TP rank 0, EP rank 0
(EngineCore_DP0 pid=14757) INFO 12-12 14:40:04 [gpu_model_runner.py:3560] Starting to load model meta-llama/Llama-3.1-8B...
(EngineCore_DP0 pid=14757) INFO 12-12 14:40:04 [cuda.py:412] Using FLASH_ATTN attention backend out of potential backends: ['FLASH_ATTN', 'FLASHINFER', 'TRITON_ATTN', 'FLEX_ATTENTION']
(EngineCore_DP0 pid=14757) INFO 12-12 14:40:09 [default_loader.py:308] Loading weights took 3.26 seconds
(EngineCore_DP0 pid=14757) INFO 12-12 14:40:09 [gpu_model_runner.py:3657] Model loading took 14.9889 GiB memory and 4.850362 seconds
(EngineCore_DP0 pid=14757) INFO 12-12 14:40:10 [gpu_worker.py:370] Available KV cache memory: 27.04 GiB
(EngineCore_DP0 pid=14757) INFO 12-12 14:40:11 [kv_cache_utils.py:1291] GPU KV cache size: 221,504 tokens
(EngineCore_DP0 pid=14757) INFO 12-12 14:40:11 [kv_cache_utils.py:1296] Maximum concurrency for 2,048 tokens per request: 108.16x
(EngineCore_DP0 pid=14757) INFO 12-12 14:40:11 [core.py:259] init engine (profile, create kv cache, warmup model) took 1.39 seconds
(EngineCore_DP0 pid=14757) WARNING 12-12 14:40:12 [vllm.py:629] Inductor compilation was disabled by user settings,Optimizations settings that are only active duringInductor compilation will be ignored.
(EngineCore_DP0 pid=14757) INFO 12-12 14:40:12 [vllm.py:722] Cudagraph is disabled under eager mode
(APIServer pid=14619) INFO 12-12 14:40:13 [api_server.py:1099] Supported tasks: ['generate']
(APIServer pid=14619) WARNING 12-12 14:40:13 [model.py:1462] Default sampling parameters have been overridden by the model's Hugging Face generation config recommended from the model creator. If this is not intended, please relaunch vLLM instance with `--generation-config vllm`.
(APIServer pid=14619) INFO 12-12 14:40:13 [serving_responses.py:201] Using default chat sampling params from model: {'temperature': 0.6, 'top_p': 0.9}
(APIServer pid=14619) INFO 12-12 14:40:13 [serving_chat.py:137] Using default chat sampling params from model: {'temperature': 0.6, 'top_p': 0.9}
(APIServer pid=14619) INFO 12-12 14:40:13 [serving_completion.py:77] Using default completion sampling params from model: {'temperature': 0.6, 'top_p': 0.9}
(APIServer pid=14619) INFO 12-12 14:40:14 [serving_chat.py:137] Using default chat sampling params from model: {'temperature': 0.6, 'top_p': 0.9}
(APIServer pid=14619) INFO 12-12 14:40:14 [api_server.py:1425] Starting vLLM API server 0 on http://0.0.0.0:8100
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:38] Available routes are:
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /openapi.json, Methods: GET, HEAD
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /docs, Methods: GET, HEAD
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /docs/oauth2-redirect, Methods: GET, HEAD
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /redoc, Methods: GET, HEAD
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /scale_elastic_ep, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /is_scaling_elastic_ep, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /tokenize, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /detokenize, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /inference/v1/generate, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /pause, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /resume, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /is_paused, Methods: GET
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /metrics, Methods: GET
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /health, Methods: GET
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /load, Methods: GET
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /v1/models, Methods: GET
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /version, Methods: GET
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /v1/responses, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /v1/responses/{response_id}, Methods: GET
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /v1/responses/{response_id}/cancel, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /v1/messages, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /v1/chat/completions, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /v1/completions, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /v1/audio/transcriptions, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /v1/audio/translations, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /ping, Methods: GET
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /ping, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /invocations, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /classify, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /v1/embeddings, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /score, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /v1/score, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /rerank, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /v1/rerank, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /v2/rerank, Methods: POST
(APIServer pid=14619) INFO 12-12 14:40:14 [launcher.py:46] Route: /pooling, Methods: POST
(APIServer pid=14619) INFO 12-12 14:42:04 [loggers.py:248] Engine 000: Avg prompt throughput: 345.4 tokens/s, Avg generation throughput: 34.9 tokens/s, Running: 4 reqs, Waiting: 0 reqs, GPU KV cache usage: 0.2%, Prefix cache hit rate: 0.0%
(APIServer pid=14619) INFO 12-12 14:42:05 [loggers.py:248] Engine 000: Avg prompt throughput: 679.8 tokens/s, Avg generation throughput: 346.4 tokens/s, Running: 12 reqs, Waiting: 0 reqs, GPU KV cache usage: 0.7%, Prefix cache hit rate: 0.0%
(APIServer pid=14619) INFO 12-12 14:42:06 [loggers.py:248] Engine 000: Avg prompt throughput: 4353.4 tokens/s, Avg generation throughput: 415.1 tokens/s, Running: 30 reqs, Waiting: 0 reqs, GPU KV cache usage: 2.9%, Prefix cache hit rate: 0.9%
(APIServer pid=14619) INFO 12-12 14:42:07 [loggers.py:248] Engine 000: Avg prompt throughput: 511.8 tokens/s, Avg generation throughput: 1007.7 tokens/s, Running: 34 reqs, Waiting: 0 reqs, GPU KV cache usage: 3.5%, Prefix cache hit rate: 3.3%
(APIServer pid=14619) INFO 12-12 14:42:08 [loggers.py:248] Engine 000: Avg prompt throughput: 3601.9 tokens/s, Avg generation throughput: 839.9 tokens/s, Running: 45 reqs, Waiting: 0 reqs, GPU KV cache usage: 5.5%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:09 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1434.0 tokens/s, Running: 38 reqs, Waiting: 0 reqs, GPU KV cache usage: 6.1%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:10 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1285.8 tokens/s, Running: 35 reqs, Waiting: 0 reqs, GPU KV cache usage: 6.7%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:11 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1166.0 tokens/s, Running: 33 reqs, Waiting: 0 reqs, GPU KV cache usage: 7.2%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:12 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1113.0 tokens/s, Running: 31 reqs, Waiting: 0 reqs, GPU KV cache usage: 7.7%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:13 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 872.8 tokens/s, Running: 22 reqs, Waiting: 0 reqs, GPU KV cache usage: 8.0%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:14 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 658.6 tokens/s, Running: 17 reqs, Waiting: 0 reqs, GPU KV cache usage: 8.3%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:15 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 503.8 tokens/s, Running: 11 reqs, Waiting: 0 reqs, GPU KV cache usage: 8.5%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:16 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 370.5 tokens/s, Running: 9 reqs, Waiting: 0 reqs, GPU KV cache usage: 8.6%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:17 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 341.6 tokens/s, Running: 9 reqs, Waiting: 0 reqs, GPU KV cache usage: 8.8%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:18 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 294.6 tokens/s, Running: 7 reqs, Waiting: 0 reqs, GPU KV cache usage: 8.9%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:19 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 260.8 tokens/s, Running: 5 reqs, Waiting: 0 reqs, GPU KV cache usage: 9.0%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:20 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 166.8 tokens/s, Running: 4 reqs, Waiting: 0 reqs, GPU KV cache usage: 9.1%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:21 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 130.9 tokens/s, Running: 3 reqs, Waiting: 0 reqs, GPU KV cache usage: 9.1%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:22 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 100.9 tokens/s, Running: 2 reqs, Waiting: 0 reqs, GPU KV cache usage: 9.2%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:23 [loggers.py:248] Engine 000: Avg prompt throughput: 29.0 tokens/s, Avg generation throughput: 74.9 tokens/s, Running: 2 reqs, Waiting: 0 reqs, GPU KV cache usage: 9.2%, Prefix cache hit rate: 2.0%
(APIServer pid=14619) INFO 12-12 14:42:24 [loggers.py:248] Engine 000: Avg prompt throughput: 2716.7 tokens/s, Avg generation throughput: 117.9 tokens/s, Running: 7 reqs, Waiting: 0 reqs, GPU KV cache usage: 10.5%, Prefix cache hit rate: 1.6%
(APIServer pid=14619) INFO 12-12 14:42:25 [loggers.py:248] Engine 000: Avg prompt throughput: 2915.0 tokens/s, Avg generation throughput: 375.2 tokens/s, Running: 20 reqs, Waiting: 0 reqs, GPU KV cache usage: 12.0%, Prefix cache hit rate: 1.9%
(APIServer pid=14619) INFO 12-12 14:42:26 [loggers.py:248] Engine 000: Avg prompt throughput: 1932.1 tokens/s, Avg generation throughput: 604.8 tokens/s, Running: 29 reqs, Waiting: 0 reqs, GPU KV cache usage: 13.2%, Prefix cache hit rate: 1.7%
(APIServer pid=14619) INFO 12-12 14:42:27 [loggers.py:248] Engine 000: Avg prompt throughput: 2886.6 tokens/s, Avg generation throughput: 875.6 tokens/s, Running: 39 reqs, Waiting: 0 reqs, GPU KV cache usage: 14.5%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:28 [loggers.py:248] Engine 000: Avg prompt throughput: 602.1 tokens/s, Avg generation throughput: 1255.9 tokens/s, Running: 40 reqs, Waiting: 0 reqs, GPU KV cache usage: 15.3%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:29 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1296.7 tokens/s, Running: 37 reqs, Waiting: 0 reqs, GPU KV cache usage: 15.9%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:30 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1206.0 tokens/s, Running: 35 reqs, Waiting: 0 reqs, GPU KV cache usage: 16.4%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:31 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1107.2 tokens/s, Running: 30 reqs, Waiting: 0 reqs, GPU KV cache usage: 16.9%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:32 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 930.4 tokens/s, Running: 24 reqs, Waiting: 0 reqs, GPU KV cache usage: 17.3%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:33 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 823.4 tokens/s, Running: 22 reqs, Waiting: 0 reqs, GPU KV cache usage: 17.6%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:34 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 733.1 tokens/s, Running: 18 reqs, Waiting: 0 reqs, GPU KV cache usage: 17.9%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:35 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 584.9 tokens/s, Running: 13 reqs, Waiting: 0 reqs, GPU KV cache usage: 18.2%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:36 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 468.0 tokens/s, Running: 12 reqs, Waiting: 0 reqs, GPU KV cache usage: 18.4%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:37 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 413.6 tokens/s, Running: 10 reqs, Waiting: 0 reqs, GPU KV cache usage: 18.6%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:38 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 287.5 tokens/s, Running: 7 reqs, Waiting: 0 reqs, GPU KV cache usage: 18.7%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:39 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 224.6 tokens/s, Running: 4 reqs, Waiting: 0 reqs, GPU KV cache usage: 18.7%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:40 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 151.8 tokens/s, Running: 4 reqs, Waiting: 0 reqs, GPU KV cache usage: 18.8%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:41 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 155.8 tokens/s, Running: 4 reqs, Waiting: 0 reqs, GPU KV cache usage: 18.9%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:42 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 107.9 tokens/s, Running: 2 reqs, Waiting: 0 reqs, GPU KV cache usage: 18.9%, Prefix cache hit rate: 5.2%
(APIServer pid=14619) INFO 12-12 14:42:43 [loggers.py:248] Engine 000: Avg prompt throughput: 644.9 tokens/s, Avg generation throughput: 111.8 tokens/s, Running: 7 reqs, Waiting: 0 reqs, GPU KV cache usage: 19.2%, Prefix cache hit rate: 5.9%
(APIServer pid=14619) INFO 12-12 14:42:44 [loggers.py:248] Engine 000: Avg prompt throughput: 1965.5 tokens/s, Avg generation throughput: 412.9 tokens/s, Running: 15 reqs, Waiting: 0 reqs, GPU KV cache usage: 19.6%, Prefix cache hit rate: 12.3%
(APIServer pid=14619) INFO 12-12 14:42:45 [loggers.py:248] Engine 000: Avg prompt throughput: 2247.8 tokens/s, Avg generation throughput: 535.5 tokens/s, Running: 21 reqs, Waiting: 0 reqs, GPU KV cache usage: 20.8%, Prefix cache hit rate: 11.3%
(APIServer pid=14619) INFO 12-12 14:42:46 [loggers.py:248] Engine 000: Avg prompt throughput: 1766.1 tokens/s, Avg generation throughput: 806.8 tokens/s, Running: 32 reqs, Waiting: 0 reqs, GPU KV cache usage: 21.9%, Prefix cache hit rate: 11.2%
(APIServer pid=14619) INFO 12-12 14:42:47 [loggers.py:248] Engine 000: Avg prompt throughput: 2172.0 tokens/s, Avg generation throughput: 997.8 tokens/s, Running: 34 reqs, Waiting: 0 reqs, GPU KV cache usage: 22.9%, Prefix cache hit rate: 13.6%
(APIServer pid=14619) INFO 12-12 14:42:48 [loggers.py:248] Engine 000: Avg prompt throughput: 2340.5 tokens/s, Avg generation throughput: 1046.0 tokens/s, Running: 40 reqs, Waiting: 0 reqs, GPU KV cache usage: 24.1%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:42:49 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1340.5 tokens/s, Running: 37 reqs, Waiting: 0 reqs, GPU KV cache usage: 24.6%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:42:50 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1103.8 tokens/s, Running: 31 reqs, Waiting: 0 reqs, GPU KV cache usage: 25.2%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:42:51 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1064.2 tokens/s, Running: 28 reqs, Waiting: 0 reqs, GPU KV cache usage: 25.6%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:42:52 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 906.1 tokens/s, Running: 26 reqs, Waiting: 0 reqs, GPU KV cache usage: 26.0%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:42:53 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 806.7 tokens/s, Running: 20 reqs, Waiting: 0 reqs, GPU KV cache usage: 26.3%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:42:54 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 614.3 tokens/s, Running: 16 reqs, Waiting: 0 reqs, GPU KV cache usage: 26.6%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:42:55 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 523.2 tokens/s, Running: 12 reqs, Waiting: 0 reqs, GPU KV cache usage: 26.8%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:42:56 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 386.4 tokens/s, Running: 9 reqs, Waiting: 0 reqs, GPU KV cache usage: 26.9%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:42:57 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 332.5 tokens/s, Running: 9 reqs, Waiting: 0 reqs, GPU KV cache usage: 27.1%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:42:58 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 268.0 tokens/s, Running: 6 reqs, Waiting: 0 reqs, GPU KV cache usage: 27.2%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:42:59 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 197.9 tokens/s, Running: 4 reqs, Waiting: 0 reqs, GPU KV cache usage: 27.3%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:43:00 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 151.8 tokens/s, Running: 3 reqs, Waiting: 0 reqs, GPU KV cache usage: 27.3%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:43:01 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 116.9 tokens/s, Running: 3 reqs, Waiting: 0 reqs, GPU KV cache usage: 27.4%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:43:02 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 107.9 tokens/s, Running: 2 reqs, Waiting: 0 reqs, GPU KV cache usage: 27.4%, Prefix cache hit rate: 15.3%
(APIServer pid=14619) INFO 12-12 14:43:03 [loggers.py:248] Engine 000: Avg prompt throughput: 2711.2 tokens/s, Avg generation throughput: 153.8 tokens/s, Running: 9 reqs, Waiting: 0 reqs, GPU KV cache usage: 28.2%, Prefix cache hit rate: 17.5%
(APIServer pid=14619) INFO 12-12 14:43:04 [loggers.py:248] Engine 000: Avg prompt throughput: 5002.3 tokens/s, Avg generation throughput: 213.7 tokens/s, Running: 20 reqs, Waiting: 0 reqs, GPU KV cache usage: 30.3%, Prefix cache hit rate: 16.9%
(APIServer pid=14619) INFO 12-12 14:43:05 [loggers.py:248] Engine 000: Avg prompt throughput: 3105.1 tokens/s, Avg generation throughput: 637.4 tokens/s, Running: 32 reqs, Waiting: 0 reqs, GPU KV cache usage: 31.8%, Prefix cache hit rate: 16.8%
(APIServer pid=14619) INFO 12-12 14:43:06 [loggers.py:248] Engine 000: Avg prompt throughput: 1815.6 tokens/s, Avg generation throughput: 867.3 tokens/s, Running: 38 reqs, Waiting: 0 reqs, GPU KV cache usage: 33.0%, Prefix cache hit rate: 16.2%
(APIServer pid=14619) INFO 12-12 14:43:07 [loggers.py:248] Engine 000: Avg prompt throughput: 2391.7 tokens/s, Avg generation throughput: 1076.9 tokens/s, Running: 44 reqs, Waiting: 0 reqs, GPU KV cache usage: 34.1%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:08 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1384.5 tokens/s, Running: 43 reqs, Waiting: 0 reqs, GPU KV cache usage: 34.7%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:09 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1354.6 tokens/s, Running: 41 reqs, Waiting: 0 reqs, GPU KV cache usage: 35.3%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:10 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1280.2 tokens/s, Running: 38 reqs, Waiting: 0 reqs, GPU KV cache usage: 35.9%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:11 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1210.8 tokens/s, Running: 35 reqs, Waiting: 0 reqs, GPU KV cache usage: 36.4%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:12 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1135.6 tokens/s, Running: 33 reqs, Waiting: 0 reqs, GPU KV cache usage: 36.9%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:13 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1030.0 tokens/s, Running: 27 reqs, Waiting: 0 reqs, GPU KV cache usage: 37.3%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:14 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 775.1 tokens/s, Running: 20 reqs, Waiting: 0 reqs, GPU KV cache usage: 37.6%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:15 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 665.8 tokens/s, Running: 18 reqs, Waiting: 0 reqs, GPU KV cache usage: 37.9%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:16 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 572.6 tokens/s, Running: 15 reqs, Waiting: 0 reqs, GPU KV cache usage: 38.2%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:17 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 461.2 tokens/s, Running: 12 reqs, Waiting: 0 reqs, GPU KV cache usage: 38.3%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:18 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 374.3 tokens/s, Running: 8 reqs, Waiting: 0 reqs, GPU KV cache usage: 38.5%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:19 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 275.6 tokens/s, Running: 7 reqs, Waiting: 0 reqs, GPU KV cache usage: 38.6%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:20 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 258.6 tokens/s, Running: 7 reqs, Waiting: 0 reqs, GPU KV cache usage: 38.7%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:21 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 258.6 tokens/s, Running: 7 reqs, Waiting: 0 reqs, GPU KV cache usage: 38.8%, Prefix cache hit rate: 17.6%
(APIServer pid=14619) INFO 12-12 14:43:22 [loggers.py:248] Engine 000: Avg prompt throughput: 722.7 tokens/s, Avg generation throughput: 241.9 tokens/s, Running: 8 reqs, Waiting: 0 reqs, GPU KV cache usage: 39.3%, Prefix cache hit rate: 17.4%
(APIServer pid=14619) INFO 12-12 14:43:23 [loggers.py:248] Engine 000: Avg prompt throughput: 113.9 tokens/s, Avg generation throughput: 340.8 tokens/s, Running: 13 reqs, Waiting: 0 reqs, GPU KV cache usage: 39.5%, Prefix cache hit rate: 17.4%
(APIServer pid=14619) INFO 12-12 14:43:24 [loggers.py:248] Engine 000: Avg prompt throughput: 5784.4 tokens/s, Avg generation throughput: 447.1 tokens/s, Running: 27 reqs, Waiting: 0 reqs, GPU KV cache usage: 41.7%, Prefix cache hit rate: 18.2%
(APIServer pid=14619) INFO 12-12 14:43:25 [loggers.py:248] Engine 000: Avg prompt throughput: 2880.0 tokens/s, Avg generation throughput: 886.9 tokens/s, Running: 32 reqs, Waiting: 0 reqs, GPU KV cache usage: 42.6%, Prefix cache hit rate: 20.4%
(APIServer pid=14619) INFO 12-12 14:43:26 [loggers.py:248] Engine 000: Avg prompt throughput: 4926.2 tokens/s, Avg generation throughput: 788.4 tokens/s, Running: 40 reqs, Waiting: 0 reqs, GPU KV cache usage: 44.2%, Prefix cache hit rate: 22.4%
(APIServer pid=14619) INFO 12-12 14:43:27 [loggers.py:248] Engine 000: Avg prompt throughput: 2160.3 tokens/s, Avg generation throughput: 1160.3 tokens/s, Running: 43 reqs, Waiting: 0 reqs, GPU KV cache usage: 45.0%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:28 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1349.6 tokens/s, Running: 41 reqs, Waiting: 0 reqs, GPU KV cache usage: 45.6%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:29 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1291.2 tokens/s, Running: 39 reqs, Waiting: 0 reqs, GPU KV cache usage: 46.2%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:30 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1162.3 tokens/s, Running: 34 reqs, Waiting: 0 reqs, GPU KV cache usage: 46.7%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:31 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1132.7 tokens/s, Running: 32 reqs, Waiting: 0 reqs, GPU KV cache usage: 47.2%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:32 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 974.9 tokens/s, Running: 27 reqs, Waiting: 0 reqs, GPU KV cache usage: 47.6%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:33 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 822.1 tokens/s, Running: 20 reqs, Waiting: 0 reqs, GPU KV cache usage: 47.9%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:34 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 580.0 tokens/s, Running: 15 reqs, Waiting: 0 reqs, GPU KV cache usage: 48.2%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:35 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 409.3 tokens/s, Running: 10 reqs, Waiting: 0 reqs, GPU KV cache usage: 48.3%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:36 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 327.6 tokens/s, Running: 9 reqs, Waiting: 0 reqs, GPU KV cache usage: 48.5%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:37 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 332.5 tokens/s, Running: 9 reqs, Waiting: 0 reqs, GPU KV cache usage: 48.6%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:38 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 309.5 tokens/s, Running: 8 reqs, Waiting: 0 reqs, GPU KV cache usage: 48.7%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:39 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 262.5 tokens/s, Running: 7 reqs, Waiting: 0 reqs, GPU KV cache usage: 48.8%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:40 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 242.6 tokens/s, Running: 5 reqs, Waiting: 0 reqs, GPU KV cache usage: 48.9%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:41 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 167.8 tokens/s, Running: 4 reqs, Waiting: 0 reqs, GPU KV cache usage: 49.0%, Prefix cache hit rate: 23.8%
(APIServer pid=14619) INFO 12-12 14:43:42 [loggers.py:248] Engine 000: Avg prompt throughput: 819.0 tokens/s, Avg generation throughput: 131.8 tokens/s, Running: 5 reqs, Waiting: 0 reqs, GPU KV cache usage: 49.4%, Prefix cache hit rate: 23.5%
(APIServer pid=14619) INFO 12-12 14:43:43 [loggers.py:248] Engine 000: Avg prompt throughput: 2647.2 tokens/s, Avg generation throughput: 201.5 tokens/s, Running: 10 reqs, Waiting: 0 reqs, GPU KV cache usage: 50.1%, Prefix cache hit rate: 24.5%
(APIServer pid=14619) INFO 12-12 14:43:44 [loggers.py:248] Engine 000: Avg prompt throughput: 2953.8 tokens/s, Avg generation throughput: 394.9 tokens/s, Running: 18 reqs, Waiting: 0 reqs, GPU KV cache usage: 51.4%, Prefix cache hit rate: 24.6%
(APIServer pid=14619) INFO 12-12 14:43:45 [loggers.py:248] Engine 000: Avg prompt throughput: 4008.0 tokens/s, Avg generation throughput: 505.5 tokens/s, Running: 26 reqs, Waiting: 0 reqs, GPU KV cache usage: 52.6%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:43:46 [loggers.py:248] Engine 000: Avg prompt throughput: 2485.2 tokens/s, Avg generation throughput: 738.1 tokens/s, Running: 31 reqs, Waiting: 0 reqs, GPU KV cache usage: 53.6%, Prefix cache hit rate: 26.2%
(APIServer pid=14619) INFO 12-12 14:43:47 [loggers.py:248] Engine 000: Avg prompt throughput: 3552.2 tokens/s, Avg generation throughput: 667.3 tokens/s, Running: 36 reqs, Waiting: 0 reqs, GPU KV cache usage: 55.1%, Prefix cache hit rate: 26.1%
(APIServer pid=14619) INFO 12-12 14:43:48 [loggers.py:248] Engine 000: Avg prompt throughput: 2713.4 tokens/s, Avg generation throughput: 938.8 tokens/s, Running: 44 reqs, Waiting: 0 reqs, GPU KV cache usage: 56.6%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:43:49 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1322.5 tokens/s, Running: 40 reqs, Waiting: 0 reqs, GPU KV cache usage: 57.2%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:43:50 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1250.8 tokens/s, Running: 38 reqs, Waiting: 0 reqs, GPU KV cache usage: 57.7%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:43:51 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1202.3 tokens/s, Running: 35 reqs, Waiting: 0 reqs, GPU KV cache usage: 58.3%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:43:52 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 1043.4 tokens/s, Running: 29 reqs, Waiting: 0 reqs, GPU KV cache usage: 58.7%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:43:53 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 964.2 tokens/s, Running: 27 reqs, Waiting: 0 reqs, GPU KV cache usage: 59.1%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:43:54 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 851.5 tokens/s, Running: 20 reqs, Waiting: 0 reqs, GPU KV cache usage: 59.5%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:43:55 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 611.7 tokens/s, Running: 17 reqs, Waiting: 0 reqs, GPU KV cache usage: 59.7%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:43:56 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 453.3 tokens/s, Running: 10 reqs, Waiting: 0 reqs, GPU KV cache usage: 59.9%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:43:57 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 306.6 tokens/s, Running: 7 reqs, Waiting: 0 reqs, GPU KV cache usage: 60.0%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:43:58 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 251.7 tokens/s, Running: 6 reqs, Waiting: 0 reqs, GPU KV cache usage: 60.1%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:43:59 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 179.7 tokens/s, Running: 4 reqs, Waiting: 0 reqs, GPU KV cache usage: 60.2%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:44:00 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 151.8 tokens/s, Running: 4 reqs, Waiting: 0 reqs, GPU KV cache usage: 60.2%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:44:01 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 151.9 tokens/s, Running: 4 reqs, Waiting: 0 reqs, GPU KV cache usage: 60.3%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:44:02 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 151.8 tokens/s, Running: 4 reqs, Waiting: 0 reqs, GPU KV cache usage: 60.4%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:44:03 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 151.9 tokens/s, Running: 4 reqs, Waiting: 0 reqs, GPU KV cache usage: 60.4%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:44:04 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 80.0 tokens/s, Running: 1 reqs, Waiting: 0 reqs, GPU KV cache usage: 60.5%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:44:05 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 40.0 tokens/s, Running: 1 reqs, Waiting: 0 reqs, GPU KV cache usage: 60.5%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:44:06 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 40.0 tokens/s, Running: 1 reqs, Waiting: 0 reqs, GPU KV cache usage: 60.5%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:44:07 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 40.0 tokens/s, Running: 1 reqs, Waiting: 0 reqs, GPU KV cache usage: 60.5%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:44:08 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 40.0 tokens/s, Running: 1 reqs, Waiting: 0 reqs, GPU KV cache usage: 60.5%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:44:09 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 7.0 tokens/s, Running: 0 reqs, Waiting: 0 reqs, GPU KV cache usage: 60.5%, Prefix cache hit rate: 25.7%
(APIServer pid=14619) INFO 12-12 14:44:10 [loggers.py:248] Engine 000: Avg prompt throughput: 0.0 tokens/s, Avg generation throughput: 0.0 tokens/s, Running: 0 reqs, Waiting: 0 reqs, GPU KV cache usage: 60.5%, Prefix cache hit rate: 25.7%

============ Serving Benchmark Result ============
Successful requests:                     300       
Benchmark duration (s):                  124.91    
Total input tokens:                      82645     
Total generated tokens:                  75249     
Request throughput (req/s):              2.40      
Output token throughput (tok/s):         602.43    
Total Token throughput (tok/s):          1264.07   
---------------Time to First Token----------------
Mean TTFT (ms):                          110.44    
Median TTFT (ms):                        94.62     
P99 TTFT (ms):                           300.58    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          33.15     
Median TPOT (ms):                        32.20     
P99 TPOT (ms):                           44.67     
---------------Inter-token Latency----------------
Mean ITL (ms):                           31.69     
Median ITL (ms):                         29.42     
P99 ITL (ms):                            98.28     
==================================================